###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/35a417ff-2189-4cd4-8053-10b085b39f7c/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alb.aws_lb.application_load_balancer will be created
  + resource "aws_lb" "application_load_balancer" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "project-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-079812d70956147d1",
          + "subnet-0805f4e1f00eeb7db",
          + "subnet-0860d936a8a44bfde",
          + "subnet-0b6b851d20f51a854",
        ]
      + tags                                                         = {
          + "Name" = "project-alb"
        }
      + tags_all                                                     = {
          + "Name" = "project-alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.alb.aws_lb_listener.alb_http_listener will be created
  + resource "aws_lb_listener" "alb_http_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication {
          + ignore_client_certificate_expiry = (known after apply)
          + mode                             = (known after apply)
          + trust_store_arn                  = (known after apply)
        }
    }

  # module.alb.aws_lb_target_group.alb_target_group will be created
  + resource "aws_lb_target_group" "alb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "project-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0e4db7f5bfa2689fb"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 300
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 60
          + unhealthy_threshold = 5
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
        }
    }

  # module.alb.aws_lb_target_group_attachment.web_server_attachments[0] will be created
  + resource "aws_lb_target_group_attachment" "web_server_attachments" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = "i-0c346c7246f0cc7f4"
    }

  # module.alb.aws_lb_target_group_attachment.web_server_attachments[1] will be created
  + resource "aws_lb_target_group_attachment" "web_server_attachments" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = "i-04c71aeb0b5cc8a5c"
    }

  # module.alb.aws_lb_target_group_attachment.web_server_attachments[2] will be created
  + resource "aws_lb_target_group_attachment" "web_server_attachments" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = "i-0e17bcb58b36866a1"
    }

  # module.alb.aws_lb_target_group_attachment.web_server_attachments[3] will be created
  + resource "aws_lb_target_group_attachment" "web_server_attachments" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = "i-067e60ff5a1df6895"
    }

  # module.alb.aws_security_group.alb_security_group will be created
  + resource "aws_security_group" "alb_security_group" {
      + arn                    = (known after apply)
      + description            = "Security group for ALB to enable HTTP access"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP access"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "project-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "project-alb-sg"
        }
      + tags_all               = {
          + "Name" = "project-alb-sg"
        }
      + vpc_id                 = "vpc-0e4db7f5bfa2689fb"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.alb.aws_lb.application_load_balancer will be created%0A  + resource "aws_lb" "application_load_balancer" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = false%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "project-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = (known after apply)%0A      + subnets                                                      = [%0A          + "subnet-079812d70956147d1",%0A          + "subnet-0805f4e1f00eeb7db",%0A          + "subnet-0860d936a8a44bfde",%0A          + "subnet-0b6b851d20f51a854",%0A        ]%0A      + tags                                                         = {%0A          + "Name" = "project-alb"%0A        }%0A      + tags_all                                                     = {%0A          + "Name" = "project-alb"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + subnet_mapping {%0A          + allocation_id        = (known after apply)%0A          + ipv6_address         = (known after apply)%0A          + outpost_id           = (known after apply)%0A          + private_ipv4_address = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A    }%0A%0A  # module.alb.aws_lb_listener.alb_http_listener will be created%0A  + resource "aws_lb_listener" "alb_http_listener" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 80%0A      + protocol          = "HTTP"%0A      + ssl_policy        = (known after apply)%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + mutual_authentication {%0A          + ignore_client_certificate_expiry = (known after apply)%0A          + mode                             = (known after apply)%0A          + trust_store_arn                  = (known after apply)%0A        }%0A    }%0A%0A  # module.alb.aws_lb_target_group.alb_target_group will be created%0A  + resource "aws_lb_target_group" "alb_target_group" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "project-tg"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags_all                           = (known after apply)%0A      + target_type                        = "instance"%0A      + vpc_id                             = "vpc-0e4db7f5bfa2689fb"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 5%0A          + interval            = 300%0A          + matcher             = "200"%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 60%0A          + unhealthy_threshold = 5%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A%0A      + target_failover {%0A          + on_deregistration = (known after apply)%0A          + on_unhealthy      = (known after apply)%0A        }%0A%0A      + target_health_state {%0A          + enable_unhealthy_connection_termination = (known after apply)%0A        }%0A    }%0A%0A  # module.alb.aws_lb_target_group_attachment.web_server_attachments[0] will be created%0A  + resource "aws_lb_target_group_attachment" "web_server_attachments" {%0A      + id               = (known after apply)%0A      + port             = 80%0A      + target_group_arn = (known after apply)%0A      + target_id        = "i-0c346c7246f0cc7f4"%0A    }%0A%0A  # module.alb.aws_lb_target_group_attachment.web_server_attachments[1] will be created%0A  + resource "aws_lb_target_group_attachment" "web_server_attachments" {%0A      + id               = (known after apply)%0A      + port             = 80%0A      + target_group_arn = (known after apply)%0A      + target_id        = "i-04c71aeb0b5cc8a5c"%0A    }%0A%0A  # module.alb.aws_lb_target_group_attachment.web_server_attachments[2] will be created%0A  + resource "aws_lb_target_group_attachment" "web_server_attachments" {%0A      + id               = (known after apply)%0A      + port             = 80%0A      + target_group_arn = (known after apply)%0A      + target_id        = "i-0e17bcb58b36866a1"%0A    }%0A%0A  # module.alb.aws_lb_target_group_attachment.web_server_attachments[3] will be created%0A  + resource "aws_lb_target_group_attachment" "web_server_attachments" {%0A      + id               = (known after apply)%0A      + port             = 80%0A      + target_group_arn = (known after apply)%0A      + target_id        = "i-067e60ff5a1df6895"%0A    }%0A%0A  # module.alb.aws_security_group.alb_security_group will be created%0A  + resource "aws_security_group" "alb_security_group" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for ALB to enable HTTP access"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "HTTP access"%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A        ]%0A      + name                   = "project-alb-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "project-alb-sg"%0A        }%0A      + tags_all               = {%0A          + "Name" = "project-alb-sg"%0A        }%0A      + vpc_id                 = "vpc-0e4db7f5bfa2689fb"%0A    }%0A%0APlan: 8 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + alb_dns_name = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @KusalThiwanka, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Deploy`*